import React from "react";
import "./ShareBlogmain.css";
function ShareBlogmain() {
  const sentenses = [
    {
      subTitle:
        "محصولات ارگانیک که در حال حاضر در برخی کشورهای دنیا از جایگاه خاصی برخوردارند، محصولاتی است که بدون دخالت هرگونه ماده‌ی شیمیایی و روش‌های مصنوعی (مانند دست‌ کاری ژنتیکی) تولید می شود.",
      paragraph1:
        "به گزارش خبرگزاری موج، محصولات ارگانیک به محصولی گفته می‌ شود که بدون دخالت هرگونه ماده‌ی شیمیایی و روش‌ های مصنوعی تولید می‌ شود یعنی محصولی که منشا آن کاملاً طبیعی باشد و در فرآیند تولید آن از هیچ گونه ماده شیمیایی یا فرآیندی که باعث تغییر در ماهیت طبیعی مواد تشکیل دهنده می‌ شود، استفاده نشده باشد. بعضی‌ ها دوست دارند تغذیه‌ سالم‌ تری داشته باشند به همین خاطر به دنبال مواد خوراکی ارگانیک و طبیعی می‌گردند. بعضی‌ ها هم چندتا محصول را با هم مقایسه می‌ کنند و وقتی همه چیز آنها با هم برابر باشد، محصولی را ترجیح می‌ دهند که برچسب طبیعی یا ارگانیک داشته باشد.انقلاب سبز و کشاورزی صنعتی در اواسط قرن بیستم ظهور کرد و توانست در کوتاه‌ مدت در اکثر نقاط دنیا افزایش تولید محصولات کشاورزی را به ارمغان آورد اما امروزه به خاطر عدم توجه به مسائل اخلاقی و اجتماعی مثل حقوق دیگر موجودات و نسل‌ های آینده به زمین‌ های کشاورزی و منابع طبیعی و صرفا پرداختن به منفعت و استفاده‌ بی‌ حد از مواد شیمیایی نه‌ تنها تولید مواد غذایی رو به کاهش است بلکه مشکلات زیست‌ محیطی، اجتماعی و اقتصادی بسیار زیادی را به وجود آورده و جمعیت زمین را با بحرانی بزرگ رو به رو کرده است.",
      paragraph2:
        "حفظ منابع طبیعی مخصوصا منابع طبیعی تجدید ناپذیر و ذخیره‌ سازی آنها برای نسل‌ های آینده با افزایش روز افزون جمعیت و نیاز به غذای بیشتر و همزمان با تخریب محیط زیست مورد توجه قرار گرفت و اندیشه‌ کشاورزی پایدار و تبدیل کشاورزی از مصرف پرنهاده به کم‌ نهاده ایجاد شد.در ابتدا غذای ارگانیک تنها شامل سبزی‌ های تازه بود و اولین مصرف‌ کنندگانی که از غذای ارگانیک استفاده می‌ کردند، به دنبال غذایی بودند بدون مواد شیمیایی، تازه و در حد امکان دارای کمترین مراحل فرآیند و به دلیل اینکه آنها باید اقلام مورد نیاز خود را مستقیما از کشاورزان خریداری می‌ کردند بنابراین شعار کشاورز خود را بشناس تا غذای خود را بشناسی از اولین شعارهایی بود که برای ترویج مصرف غذاهای ارگانیک، گفته شد.حفظ منابع طبیعی مخصوصا منابع طبیعی تجدید ناپذیر و ذخیره‌ سازی آنها برای نسل‌ های آینده با افزایش روز افزون جمعیت و نیاز به غذای بیشتر و همزمان با تخریب محیط زیست مورد توجه قرار گرفت و اندیشه‌ کشاورزی پایدار و تبدیل کشاورزی از مصرف پرنهاده به کم‌ نهاده ایجاد شد.در ابتدا غذای ارگانیک تنها شامل سبزی‌ های تازه بود و اولین مصرف‌ کنندگانی که از غذای ارگانیک استفاده می‌ کردند، به دنبال غذایی بودند بدون مواد شیمیایی، تازه و در حد امکان دارای کمترین مراحل فرآیند و به دلیل اینکه آنها باید اقلام مورد نیاز خود را مستقیما از کشاورزان خریداری می‌ کردند بنابراین شعار کشاورز خود را بشناس تا غذای خود را بشناسی از اولین شعارهایی بود که برای ترویج مصرف غذاهای ارگانیک، گفته شد.حفظ منابع طبیعی مخصوصا منابع طبیعی تجدید ناپذیر و ذخیره‌ سازی آنها برای نسل‌ های آینده با افزایش روز افزون جمعیت و نیاز به غذای بیشتر و همزمان با تخریب محیط زیست مورد توجه قرار گرفت و اندیشه‌ کشاورزی پایدار و تبدیل کشاورزی از مصرف پرنهاده به کم‌ نهاده ایجاد شد.در ابتدا غذای ارگانیک تنها شامل سبزی‌ های تازه بود و اولین مصرف‌ کنندگانی که از غذای ارگانیک استفاده می‌ کردند، به دنبال غذایی بودند بدون مواد شیمیایی، تازه و در حد امکان دارای کمترین مراحل فرآیند و به دلیل اینکه آنها باید اقلام مورد نیاز خود را مستقیما از کشاورزان خریداری می‌ کردند بنابراین شعار کشاورز خود را بشناس تا غذای خود را بشناسی از اولین شعارهایی بود که برای ترویج مصرف غذاهای ارگانیک، گفته شد.",
      img: "https://static3.mojnews.com/servev2/xmWrbrdJWQU5/5nlFyjMYD7g,/%D9%85%D8%AD%D8%B5%D9%88%D9%84%D8%A7%D8%AA+%D8%A7%D8%B1%DA%AF%D8%A7%D9%86%DB%8C%DA%A91.jpg",
    },
  ];
  return (
    <div className="emtehan">
      <div className="ShareBlogmain-container">
        {sentenses.map((sentense) => {
          return (
            <div>
              <h4>{sentense.subTitle}</h4>
              <p>{sentense.paragraph1}</p>
              <div style={{ width: "100%" }}>
                <img
                  src={sentense.img}
                  width="100%"
                  height="auto"
                  alt=""
                  style={{ objectFit: "fill" }}
                />
              </div>
              <h4>{sentense.subTitle}</h4>
              <p>{sentense.paragraph2}</p>
            </div>
          );
        })}
      </div>

      <div className="shareBlog-submain-icon">
        <div style={{ width: "30%" }}>
          <img
            src="./nahoor home page/Share Blogs page/Icons/Outline/Brands/Facebook.svg"
            alt=""
            width="100%"
          />
        </div>
        <div style={{ width: "30%" }}>
          <img
            src="./nahoor home page/Share Blogs page/Icons/Outline/Brands/Linkedin.svg"
            alt=""
            width="100%"
          />
        </div>
        <div style={{ width: "30%" }}>
          <img
            src="./nahoor home page/Share Blogs page/Icons/Outline/Brands/Twitter.svg"
            alt=""
            width="100%"
          />
        </div>
        <div style={{ width: "30%" }}>
          <img
            src="./nahoor home page/Share Blogs page/Icons/Outline/Files/Copy.svg"
            alt=""
            width="100%"
          />
        </div>
        <div style={{ width: "30%" }}>
          <img
            src="./nahoor home page/Share Blogs page/Icons/Outline/Communication/Share.svg"
            alt=""
            width="100%"
          />
        </div>
      </div>
    </div>
  );
}
export default ShareBlogmain;
