import React from "react";
import "./Header.css";
const Header = () => {
  const sentenses=[{title:"ما در ناهور چه کاری انجام میدهیم", paragraph:""}]
  return (
    <>
    <div className="About-container">
      <div className="About-title">
        <div className="AboutUs-right">
          <div>
            <img
              className="AboutUs-Logo"
              width="100%"
              src="./nahoor home page/About Page/behinde.svg"
              alt=""
            />
          </div>
          <div>
            <h1
              style={{ fontSize: "2.5rem", fontWeight: "bold" }}
              className="AboutUsLogo-title"
            >
              درباره ناهور
            </h1>
          </div>
        </div>
      </div>
      <div className="About-content">
        <h2>ما در ناهور چه کاری انجام میدهیم؟ </h2>
        <p className="About-paragraph">
          لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
          بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
          گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
          ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
          از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد. معمولا
          طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی
          استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه
          طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر
          می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است. از آنجایی
          که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را
          ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با
          استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا
          مرحله طراحی و صفحه‌بندی را به پایان برند.
          
          طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر
          می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است. از آنجایی
          که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را
          ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با
          استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا
          مرحله طراحی و صفحه‌بندی را به پایان برن"
        </p>
      </div>
    </div>
    <div style={{width: '25%', minWidth: '500px',  paddingRight: '100px'}}><img src="./nahoor home page/About Page/about nahoor vector.svg" width="100%"/></div>
</>
  );
};

export default Header;
