import React from "react";
import "./Header.css";
const Header = () => {
  const sentenses = [
    {
      title: "ما در ناهور چه کاری انجام میدهیم",
      paragraph:
        " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
  ];
  return (
    <>
      <div className="About-container">
        <div className="About-title">
          <div className="AboutUs-right">
            <div>
              <img
                className="AboutUs-Logo"
                width="100%"
                src="./nahoor home page/About Page/behinde.svg"
                alt=""
              />
            </div>
            <div>
              <h1
                style={{ fontSize: "2.5rem", fontWeight: "bold" }}
                className="AboutUsLogo-title"
              >
                درباره ناهور
              </h1>
            </div>
          </div>
        </div>

        {sentenses.map((sentense) => {
          return (
            <div className="About-content">
              <h2>{sentense.title}</h2>
              <p className="About-paragraph">{sentense.paragraph}</p>
            </div>
          );
        })}
      </div>
      <div className="About-img-bottom" >
        <img
          src="./nahoor home page/About Page/about nahoor vector.svg"
          width="100%"
        />
      </div>
    </>
  );
};

export default Header;
